Fuentes/ficohsacore-osb-7e5cceccb837/Middleware/v2/BusinessServices/OSB/ConsultaPlanesCredito/wsdl/ConsultaPlanesCredito.wsdl

<WL5G3N0:definitions name="consultaPlanesCreditoPS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/consultaPlanesCreditoPS/" xmlns:WL5G3N0="http://schemas.xmlsoap.org/wsdl/" xmlns:WL5G3N1="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:WL5G3N2="http://www.ficohsa.com.hn/middleware.services/consultaPlanesCreditoTypes" xmlns:WL5G3N3="http://www.ficohsa.com.hn/middleware.services/consultaPlanesCreditoPS/" xmlns:WL5G3N4="http://schemas.xmlsoap.org/wsdl/soap/">
  <WL5G3N0:types>
    <xsd:schema xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:con="http://www.ficohsa.com.hn/middleware.services/consultaPlanesCreditoPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.ficohsa.com.hn/middleware.services/consultaPlanesCreditoTypes" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../xsd/XMLSchema_1616260754.xsd"/>
    </xsd:schema>
    <xsd:schema xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:con="http://www.ficohsa.com.hn/middleware.services/consultaPlanesCreditoPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.ficohsa.com.hn/middleware.services/consultaPlanesCreditoTypes" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/consultaPlanesCreditoTypes" schemaLocation="../xsd/XMLSchema_-324660614.xsd"/>
    </xsd:schema>
  </WL5G3N0:types>
  <WL5G3N0:message name="requestHeader">
    <WL5G3N0:part element="WL5G3N1:RequestHeader" name="RequestHeader"/>
  </WL5G3N0:message>
  <WL5G3N0:message name="responseHeader">
    <WL5G3N0:part element="WL5G3N1:ResponseHeader" name="ResponseHeader"/>
  </WL5G3N0:message>
  <WL5G3N0:message name="consultaPlanesCredito">
    <WL5G3N0:part element="WL5G3N2:consultaPlanesCredito" name="parameters"/>
  </WL5G3N0:message>
  <WL5G3N0:message name="consultaPlanesCreditoResponse">
    <WL5G3N0:part element="WL5G3N2:consultaPlanesCreditoResponse" name="result"/>
  </WL5G3N0:message>
  <WL5G3N0:portType name="consultaPlanesCreditoPS">
    <WL5G3N0:operation name="consultaPlanesCredito" parameterOrder="parameters RequestHeader ResponseHeader">
      <WL5G3N0:input message="WL5G3N3:consultaPlanesCredito"/>
      <WL5G3N0:output message="WL5G3N3:consultaPlanesCreditoResponse"/>
    </WL5G3N0:operation>
  </WL5G3N0:portType>
  <WL5G3N0:binding name="consultaPlanesCreditoPSSOAP" type="WL5G3N3:consultaPlanesCreditoPS">
    <WL5G3N4:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <WL5G3N0:operation name="consultaPlanesCredito">
      <WL5G3N4:operation soapAction="http://www.ficohsa.com.hn/middleware.services/consultaPlanesCreditoPS/consultaPlanesCredito"/>
      <WL5G3N0:input>
        <WL5G3N4:header message="WL5G3N3:requestHeader" part="RequestHeader" use="literal"/>
        <WL5G3N4:body parts="parameters" use="literal"/>
      </WL5G3N0:input>
      <WL5G3N0:output>
        <WL5G3N4:header message="WL5G3N3:responseHeader" part="ResponseHeader" use="literal"/>
        <WL5G3N4:body parts="result" use="literal"/>
      </WL5G3N0:output>
    </WL5G3N0:operation>
  </WL5G3N0:binding>
  <WL5G3N0:service name="consultaPlanesCreditoPS">
    <WL5G3N0:port binding="WL5G3N3:consultaPlanesCreditoPSSOAP" name="consultaPlanesCreditoPSSOAP">
      <WL5G3N4:address location="https://172.23.13.19:8004/Middleware/OperationsAndExecution/Cards/ConsultaPlanesCredito"/>
    </WL5G3N0:port>
  </WL5G3N0:service>
</WL5G3N0:definitions>